#pragma once
#include <iostream>
#include <Windows.h>
using namespace std;

//基础界面
void Basic()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*      1）用户登录             2）用户注册            3）退出程序                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}

//退出界面
void ExitSystem()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                       感谢您的使用，欢迎您下次光临                               *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}

//注册界面
void Sign()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*          请输入您的姓名，账号与密码注册，用空格间隔（姓名 账号 密码）            *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void SignSuccess()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                          注册成功,请您继续操作                                   *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}

//登录界面
void Login()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*              请输入您的账号与密码登录，用空格间隔（账号 密码）                   *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void LoginSuccess()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*        1)增加商品信息                               2）删除商品信息              *" << endl;
	cout << "*        3)修改商品信息                               4）查看商品列表              *" << endl;
	cout << "*        5)查询商品信息(编号查询)                     6）查询商品信息（名称查询）  *" << endl;
	cout << "*        7)返回上一级                                 8)退出程序                   *" << endl;
	cout << "************************************************************************************" << endl;
}
void LoginFail()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                     您输入的账号密码不正确，请重新输入                           *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}

//选项非已给选项的错误界面
void ChoiceError()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                        请您重新输入屏幕上的选项                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}

//密码多次错误停止界面
void CheckTimeUp()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                   您过多次数的输错账号密码，系统退出                             *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                          欢迎您的下次使用                                        *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}

//添加错误界面
void UListAddError()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                    添加失败！！ 存在相同的编号或姓名！！                         *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}

//用户界面选择
void FuctionChoice()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*        1）商品管理                2）用户管理                3）权限管理         *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}

//管理员用户界面
void UserAdmin()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*        1)增加用户信息                               2）删除用户信息              *" << endl;
	cout << "*        3)修改用户信息                               4）查询用户列表              *" << endl;
	cout << "*        5)查询用户信息（编号）                       6）查询用户信息（姓名）      *" << endl;
	cout << "*        7)返回上一级                                 8)退出程序                   *" << endl;
	cout << "************************************************************************************" << endl;
}
void UserAdminError()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*             对不起，您当前无权使用该功能，请提升权限后重试                       *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}

//权限升级界面
void AdminUp()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                     请输入管理员口令以提升用户权限                               *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void AdminUpSuccess()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                      口令正确，已将您提升为管理员                                *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void AdminUpError()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                     口令无效，请重新输入有效的口令                               *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}

//商品添加界面
void CAdd()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*             请依次输入商品的名称，价格，折扣如：牛奶 5.00 0.8                    *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void CListAddError()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                    添加失败！！ 存在相同的编号或商品名称！！                     *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void CListAddSuccess()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                       商品填加成功，请继续操作                                   *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}

//商品删除界面
void CDel()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                          请您输入商品的编号                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void CListDelError()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                    未找到该商品，请重新确定商品编号                              *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void CListDelSuccess()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                       商品信息删除成功，请继续操作                               *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}


//商品修改界面
void CChange()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                         请选择您需要更改的信息                                   *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*           1）商品编号   2）商品名称    3）商品价格   4）商品折扣                 *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void CChangeEnter()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*               请您输入编号以及更改信息，使用空格区分如：1 牛奶                   *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void CChangeErrorS()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                         欲替换数据未更改原来数据！                                   *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void CChangeErrorN()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                   未找到该编号,请确定编号后重新操作                              *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void CChangeSuccess()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                        信息更改成功，请继续操作                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}

//商品查询界面
void CSeekO()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                        请您输入商品的编号以查询                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void CSeekN()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                        请您输入商品的名称以查询                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void CSeekError()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                    未找到该编号的商品，请重新操作                                *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void CSeekSuccess()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                       查找成功，查找结果如下所示                                 *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}


//用户添加界面
void UAdd()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品用户管理系统                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*             请依次输入用户的名称，账号，密码如：王五 123 123                     *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void UListAddSuccess()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品用户管理系统                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                          用户填加成功，请继续操作                                *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}

//用户删除界面
void UDel()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品用户管理系统                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                             请您输入用户的编号                                   *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void UListDelError()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品用户管理系统                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                        未找到该用户，请重新确定用户编号                          *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void UListDelSuccess()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品用户管理系统                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                       用户信息删除成功，请继续操作                               *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}

//用户修改界面
void UChange()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品用户管理系统                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                           请选择您需要更改的信息                                 *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*           1）用户编号   2）用户姓名    3）用户账号   4）用户密码                 *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void UChangeEnter()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品用户管理系统                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*               请您输入编号以及更改信息，使用空格区分如：1  更改信息              *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void UChangeErrorS()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品用户管理系统                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                         欲替换数据未更改原来数据！                               *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void UChangeErrorN()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品用户管理系统                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                   未找到该编号,请确定编号后重新操作                              *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void UChangeSuccess()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品用户管理系统                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                        信息更改成功，请继续操作                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}

//用户查询界面
void USeekO()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品用户管理系统                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                          请您输入用户的编号以查询                                *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void USeekN()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品用户管理系统                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                          请您输入用户的姓名以查询                                *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void USeekError()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品用户管理系统                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                        未找到该编号的用户，请重新操作                            *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void USeekSuccess()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品用户管理系统                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                         查找成功，查找结果如下所示                               *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}

//重复操作界面
void Repeat()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                       请问您是否要继续相同的操作                                 *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                      输入任意键以继续，输入2退出                                 *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}

//库中无内容错误界面
void UListNotingError()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                      当前用户库没有用户请先注册                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}
void CListNotingError()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                      当前商品库没有商品请先增加商品                              *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}

//删除检查界面
void DelCheck()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                           是否确认删除该信息？                                   *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*               1）确定                            2）取消                         *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}

//显示错误
void ShowError()
{
	system("cls");
	cout << "************************************************************************************" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                            小型商品管理系统                                      *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                    当前库中不存在数据，请添加后重试                              *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "*                                                                                  *" << endl;
	cout << "************************************************************************************" << endl;
}